# This file acts as the configuration and reference document for particular test segments. It is
# used to outsource long text segments from source code.
#
# Error messages are declared within "segment declarations". A segment declaration consists of a
# unique identifier, followed by the corresponding text segment and ends with a line containing
# only the keyword "SEGMENT-END". Segment declarations should be seperated by multiple empty lines
# for clarity.
#
# Line continuation is possible, by placing a \ at the very end of a line.
# Colorization can be achieved by using the predefined variables:
# RED>, YELLOW>, GREEN>, NORMAL>



arduino_trait.sh: No Arduino:
RED>No Arduino connected to this computer could be found.NORMAL>
Please try reconnecting the device.
SEGMENT-END



arduino_trait.sh: Multiple Arduinos:
RED>Multiple Arduinos connected to this computer were found.NORMAL>
Please disconnect all but one device.
SEGMENT-END



write_runtime_index_into.sh: Header:
# Declare which types of servers you want to use for the lightshow.
# Each declaration should have the form:
# <instance name>: <server name>
#
# Lines starting with # are ignored.
#
# Possible <server name>s are:
SEGMENT-END



write_runtime_index_into.sh: Duplicate instance names:
RED>The specified configuration contains duplicate instance names.NORMAL>
Each instance must have a unique name.
The duplicate name are:
SEGMENT-END



write_runtime_index_into.sh: Invalid server names:
RED>The specified configuration contains invalid server names.NORMAL>
You may only use names of existing servers.
The invalid names are:
SEGMENT-END



configure_server_instance.sh: Header:
# Declare which of the server instance's traits should have which values.
# Each declaration should have the form:
# <trait name>: <value>
#
# Lines starting with # are ignored.
#
# Possible <trait name>s for this server instance are:
SEGMENT-END



configure_server_instance.sh: Invalid trait names:
RED>The specified configuration contains invalid trait names.NORMAL>
Trait names must be pre-defined for the given server.
The invalid names are:
SEGMENT-END



configure_server_instance.sh: Duplicate trait names:
RED>The specified configuration contains duplicate trait declarations.NORMAL>
A configuration may only declare each trait once.
The duplicate traits are:
SEGMENT-END



configure_server_instance.sh: Invalid trait values:
RED>The specified configuration contains invalid trait values.NORMAL>
A trait value must match its expected type.
The invalid trait values are:
SEGMENT-END



lightshow: Usage:
RED>Invalid argument.NORMAL>
The Live Lightshow CLI supports the following subcommands (with arguments in YELLOW><>NORMAL> \
and nested subcommands after YELLOW>▸NORMAL>):
• YELLOW>initialize NORMAL>
• YELLOW>start NORMAL>
• YELLOW>end NORMAL>
• YELLOW>live NORMAL>
  YELLOW>▸NORMAL> status
  YELLOW>▸NORMAL> configure YELLOW><NORMAL>server instanceYELLOW>> NORMAL>
• YELLOW>directory NORMAL>
• YELLOW>reindex NORMAL>
SEGMENT-END



lightshow: <live> subcommand usage:
RED>Invalid argument.NORMAL>
The YELLOW>liveNORMAL> subcommand supports the following subcommands:
• YELLOW>status NORMAL>
• YELLOW>configure <NORMAL>server instanceYELLOW>> NORMAL>
SEGMENT-END
