# This file acts as the configuration and reference document for particular test segments. It is
# used to outsource long text segments from source code.
#
# Error messages are declared within "segment declarations". A segment declaration consists of a
# unique identifier, followed by the corresponding text segment and ends with a line containing
# only the keyword "SEGMENT-END". Segment declarations should be seperated by multiple empty lines
# for clarity.
#
# Line continuation is possible, by placing a \ at the very end of a line.
# Colorization can be achieved by using the predefined variables:
# RED>, YELLOW>, GREEN>, NORMAL>



arduino_trait.sh: No Arduino:
RED>No Arduino connected to this computer could be found.NORMAL>
Please try reconnecting the device.
SEGMENT-END



arduino_trait.sh: Multiple Arduinos:
RED>Multiple Arduinos connected to this computer were found.NORMAL>
Please disconnect all but one device.
SEGMENT-END



write_runtime_index_into.sh: Header:
# Declare which types of servers you want to use for the lightshow.
# Each declaration should have the form:
# <instance identifier>: <server type>
#
# Lines starting with # are ignored.
#
# Possible <server type>s are:
SEGMENT-END



write_runtime_index_into.sh: Duplicate instance-IDs:
RED>The specified configuration contains duplicate instance identifiers.NORMAL>
Each instance must have a unique name.
The duplicate identifiers are:
SEGMENT-END



write_runtime_index_into.sh: Invalid server-IDs:
RED>The specified configuration contains invalid server identifiers.NORMAL>
You may only use identifiers of existing server types.
The invalid identifiers are:
SEGMENT-END



configure_server_instance.sh: Header:
# Declare which of the server instance's traits should have which values.
# Each declaration should have the form:
# <trait identifier>: <value>
#
# Lines starting with # are ignored.
#
# Possible <trait identifier>s for this server instance are:
SEGMENT-END



configure_server_instance.sh: Invalid trait-IDs:
RED>The specified configuration contains invalid trait identifiers.NORMAL>
Trait identifiers must be defined for the given server type.
The invalid identifiers are:
SEGMENT-END



configure_server_instance.sh: Duplicate trait-IDs:
RED>The specified configuration contains duplicate trait declarations.NORMAL>
A configuration may only declare each trait once.
The duplicate traits are:
SEGMENT-END



configure_server_instance.sh: Invalid trait-values:
RED>The specified configuration contains invalid trait values.NORMAL>
A trait value must match its expected type.
The invalid trait values are:
SEGMENT-END



lightshow: Usage:
RED>Invalid argument.NORMAL>
The Live Lightshow CLI supports the following subcommands (with arguments in YELLOW><>NORMAL>):
◦ YELLOW>initialize NORMAL>
◦ YELLOW>start NORMAL>
◦ YELLOW>end NORMAL>
◦ YELLOW>status NORMAL>
◦ YELLOW>configure <NORMAL>instanceYELLOW>> NORMAL>
◦ YELLOW>directory NORMAL>
◦ YELLOW>reindex NORMAL>
SEGMENT-END
